{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "Encoder-Input"}, "name": "Encoder-Input", "inbound_nodes": []}, {"class_name": "EmbeddingRet", "config": {"name": "Encoder-Token-Embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3812, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "Encoder-Token-Embedding", "inbound_nodes": [[["Encoder-Input", 0, 0, {}]]]}, {"class_name": "TrigPosEmbedding", "config": {"name": "Encoder-Embedding", "trainable": true, "dtype": "float32", "mode": "add", "output_dim": null}, "name": "Encoder-Embedding", "inbound_nodes": [[["Encoder-Token-Embedding", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-1-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-1-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-Embedding", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-1-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Encoder-1-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-1-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-1-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-1-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-Embedding", 0, 0, {}], ["Encoder-1-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-1-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-1-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-1-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-1-FeedForward", "trainable": true, "dtype": "float32", "units": 128, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-1-FeedForward", "inbound_nodes": [[["Encoder-1-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-1-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Encoder-1-FeedForward-Dropout", "inbound_nodes": [[["Encoder-1-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-1-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-1-FeedForward-Add", "inbound_nodes": [[["Encoder-1-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-1-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-1-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-1-FeedForward-Norm", "inbound_nodes": [[["Encoder-1-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-2-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-2-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-1-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-2-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Encoder-2-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-2-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-2-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-2-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-1-FeedForward-Norm", 0, 0, {}], ["Encoder-2-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-2-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-2-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-2-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-2-FeedForward", "trainable": true, "dtype": "float32", "units": 128, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-2-FeedForward", "inbound_nodes": [[["Encoder-2-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-2-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Encoder-2-FeedForward-Dropout", "inbound_nodes": [[["Encoder-2-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-2-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-2-FeedForward-Add", "inbound_nodes": [[["Encoder-2-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-2-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-2-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-2-FeedForward-Norm", "inbound_nodes": [[["Encoder-2-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-3-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-3-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-2-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "Decoder-Input"}, "name": "Decoder-Input", "inbound_nodes": []}, {"class_name": "Dropout", "config": {"name": "Encoder-3-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Encoder-3-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-3-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "EmbeddingRet", "config": {"name": "Decoder-Token-Embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3812, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "Decoder-Token-Embedding", "inbound_nodes": [[["Decoder-Input", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-3-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-3-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-2-FeedForward-Norm", 0, 0, {}], ["Encoder-3-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "TrigPosEmbedding", "config": {"name": "Decoder-Embedding", "trainable": true, "dtype": "float32", "mode": "add", "output_dim": null}, "name": "Decoder-Embedding", "inbound_nodes": [[["Decoder-Token-Embedding", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-3-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-3-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-3-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Decoder-1-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": true}, "name": "Decoder-1-MultiHeadSelfAttention", "inbound_nodes": [[["Decoder-Embedding", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-3-FeedForward", "trainable": true, "dtype": "float32", "units": 128, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-3-FeedForward", "inbound_nodes": [[["Encoder-3-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Decoder-1-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Decoder-1-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Decoder-1-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-3-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Encoder-3-FeedForward-Dropout", "inbound_nodes": [[["Encoder-3-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Decoder-1-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Decoder-1-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Decoder-Embedding", 0, 0, {}], ["Decoder-1-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-3-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-3-FeedForward-Add", "inbound_nodes": [[["Encoder-3-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-3-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Decoder-1-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Decoder-1-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Decoder-1-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-3-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-3-FeedForward-Norm", "inbound_nodes": [[["Encoder-3-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Decoder-1-MultiHeadQueryAttention", "trainable": true, "dtype": "float32", "head_num": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Decoder-1-MultiHeadQueryAttention", "inbound_nodes": [[["Decoder-1-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-3-FeedForward-Norm", 0, 0, {}], ["Encoder-3-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Decoder-1-MultiHeadQueryAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Decoder-1-MultiHeadQueryAttention-Dropout", "inbound_nodes": [[["Decoder-1-MultiHeadQueryAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Decoder-1-MultiHeadQueryAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Decoder-1-MultiHeadQueryAttention-Add", "inbound_nodes": [[["Decoder-1-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Decoder-1-MultiHeadQueryAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Decoder-1-MultiHeadQueryAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Decoder-1-MultiHeadQueryAttention-Norm", "inbound_nodes": [[["Decoder-1-MultiHeadQueryAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Decoder-1-FeedForward", "trainable": true, "dtype": "float32", "units": 128, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Decoder-1-FeedForward", "inbound_nodes": [[["Decoder-1-MultiHeadQueryAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Decoder-1-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Decoder-1-FeedForward-Dropout", "inbound_nodes": [[["Decoder-1-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Decoder-1-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Decoder-1-FeedForward-Add", "inbound_nodes": [[["Decoder-1-MultiHeadQueryAttention-Norm", 0, 0, {}], ["Decoder-1-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Decoder-1-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Decoder-1-FeedForward-Norm", "inbound_nodes": [[["Decoder-1-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Decoder-2-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": true}, "name": "Decoder-2-MultiHeadSelfAttention", "inbound_nodes": [[["Decoder-1-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Decoder-2-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Decoder-2-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Decoder-2-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Decoder-2-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Decoder-2-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Decoder-1-FeedForward-Norm", 0, 0, {}], ["Decoder-2-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Decoder-2-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Decoder-2-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Decoder-2-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Decoder-2-MultiHeadQueryAttention", "trainable": true, "dtype": "float32", "head_num": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Decoder-2-MultiHeadQueryAttention", "inbound_nodes": [[["Decoder-2-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-3-FeedForward-Norm", 0, 0, {}], ["Encoder-3-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Decoder-2-MultiHeadQueryAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Decoder-2-MultiHeadQueryAttention-Dropout", "inbound_nodes": [[["Decoder-2-MultiHeadQueryAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Decoder-2-MultiHeadQueryAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Decoder-2-MultiHeadQueryAttention-Add", "inbound_nodes": [[["Decoder-2-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Decoder-2-MultiHeadQueryAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Decoder-2-MultiHeadQueryAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Decoder-2-MultiHeadQueryAttention-Norm", "inbound_nodes": [[["Decoder-2-MultiHeadQueryAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Decoder-2-FeedForward", "trainable": true, "dtype": "float32", "units": 128, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Decoder-2-FeedForward", "inbound_nodes": [[["Decoder-2-MultiHeadQueryAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Decoder-2-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Decoder-2-FeedForward-Dropout", "inbound_nodes": [[["Decoder-2-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Decoder-2-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Decoder-2-FeedForward-Add", "inbound_nodes": [[["Decoder-2-MultiHeadQueryAttention-Norm", 0, 0, {}], ["Decoder-2-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Decoder-2-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Decoder-2-FeedForward-Norm", "inbound_nodes": [[["Decoder-2-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Decoder-3-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": true}, "name": "Decoder-3-MultiHeadSelfAttention", "inbound_nodes": [[["Decoder-2-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Decoder-3-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Decoder-3-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Decoder-3-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Decoder-3-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Decoder-3-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Decoder-2-FeedForward-Norm", 0, 0, {}], ["Decoder-3-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Decoder-3-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Decoder-3-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Decoder-3-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Decoder-3-MultiHeadQueryAttention", "trainable": true, "dtype": "float32", "head_num": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Decoder-3-MultiHeadQueryAttention", "inbound_nodes": [[["Decoder-3-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-3-FeedForward-Norm", 0, 0, {}], ["Encoder-3-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Decoder-3-MultiHeadQueryAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Decoder-3-MultiHeadQueryAttention-Dropout", "inbound_nodes": [[["Decoder-3-MultiHeadQueryAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Decoder-3-MultiHeadQueryAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Decoder-3-MultiHeadQueryAttention-Add", "inbound_nodes": [[["Decoder-3-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Decoder-3-MultiHeadQueryAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Decoder-3-MultiHeadQueryAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Decoder-3-MultiHeadQueryAttention-Norm", "inbound_nodes": [[["Decoder-3-MultiHeadQueryAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Decoder-3-FeedForward", "trainable": true, "dtype": "float32", "units": 128, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Decoder-3-FeedForward", "inbound_nodes": [[["Decoder-3-MultiHeadQueryAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Decoder-3-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "Decoder-3-FeedForward-Dropout", "inbound_nodes": [[["Decoder-3-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Decoder-3-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Decoder-3-FeedForward-Add", "inbound_nodes": [[["Decoder-3-MultiHeadQueryAttention-Norm", 0, 0, {}], ["Decoder-3-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Decoder-3-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Decoder-3-FeedForward-Norm", "inbound_nodes": [[["Decoder-3-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "EmbeddingSim", "config": {"name": "Decoder-Output", "trainable": true, "dtype": "float32", "use_bias": true, "initializer": {"class_name": "Zeros", "config": {}}, "regularizer": null, "constraint": null, "stop_gradient": false}, "name": "Decoder-Output", "inbound_nodes": [[["Decoder-3-FeedForward-Norm", 0, 0, {}], ["Decoder-Token-Embedding", 0, 1, {}]]]}], "input_layers": [["Encoder-Input", 0, 0], ["Decoder-Input", 0, 0]], "output_layers": [["Decoder-Output", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Decoder-1-FeedForward/Decoder-1-FeedForward_W1", "shape": [32, 128], "dtype": "float32"}, {"name": "Decoder-1-FeedForward/Decoder-1-FeedForward_b1", "shape": [128], "dtype": "float32"}, {"name": "Decoder-1-FeedForward/Decoder-1-FeedForward_W2", "shape": [128, 32], "dtype": "float32"}, {"name": "Decoder-1-FeedForward/Decoder-1-FeedForward_b2", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-FeedForward-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-FeedForward-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadQueryAttention/Decoder-1-MultiHeadQueryAttention_Wq", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadQueryAttention/Decoder-1-MultiHeadQueryAttention_bq", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadQueryAttention/Decoder-1-MultiHeadQueryAttention_Wk", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadQueryAttention/Decoder-1-MultiHeadQueryAttention_bk", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadQueryAttention/Decoder-1-MultiHeadQueryAttention_Wv", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadQueryAttention/Decoder-1-MultiHeadQueryAttention_bv", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadQueryAttention/Decoder-1-MultiHeadQueryAttention_Wo", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadQueryAttention/Decoder-1-MultiHeadQueryAttention_bo", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadQueryAttention-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadQueryAttention-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadSelfAttention/Decoder-1-MultiHeadSelfAttention_Wq", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadSelfAttention/Decoder-1-MultiHeadSelfAttention_bq", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadSelfAttention/Decoder-1-MultiHeadSelfAttention_Wk", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadSelfAttention/Decoder-1-MultiHeadSelfAttention_bk", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadSelfAttention/Decoder-1-MultiHeadSelfAttention_Wv", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadSelfAttention/Decoder-1-MultiHeadSelfAttention_bv", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadSelfAttention/Decoder-1-MultiHeadSelfAttention_Wo", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadSelfAttention/Decoder-1-MultiHeadSelfAttention_bo", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadSelfAttention-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Decoder-1-MultiHeadSelfAttention-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-FeedForward/Decoder-2-FeedForward_W1", "shape": [32, 128], "dtype": "float32"}, {"name": "Decoder-2-FeedForward/Decoder-2-FeedForward_b1", "shape": [128], "dtype": "float32"}, {"name": "Decoder-2-FeedForward/Decoder-2-FeedForward_W2", "shape": [128, 32], "dtype": "float32"}, {"name": "Decoder-2-FeedForward/Decoder-2-FeedForward_b2", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-FeedForward-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-FeedForward-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadQueryAttention/Decoder-2-MultiHeadQueryAttention_Wq", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadQueryAttention/Decoder-2-MultiHeadQueryAttention_bq", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadQueryAttention/Decoder-2-MultiHeadQueryAttention_Wk", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadQueryAttention/Decoder-2-MultiHeadQueryAttention_bk", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadQueryAttention/Decoder-2-MultiHeadQueryAttention_Wv", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadQueryAttention/Decoder-2-MultiHeadQueryAttention_bv", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadQueryAttention/Decoder-2-MultiHeadQueryAttention_Wo", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadQueryAttention/Decoder-2-MultiHeadQueryAttention_bo", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadQueryAttention-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadQueryAttention-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadSelfAttention/Decoder-2-MultiHeadSelfAttention_Wq", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadSelfAttention/Decoder-2-MultiHeadSelfAttention_bq", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadSelfAttention/Decoder-2-MultiHeadSelfAttention_Wk", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadSelfAttention/Decoder-2-MultiHeadSelfAttention_bk", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadSelfAttention/Decoder-2-MultiHeadSelfAttention_Wv", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadSelfAttention/Decoder-2-MultiHeadSelfAttention_bv", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadSelfAttention/Decoder-2-MultiHeadSelfAttention_Wo", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadSelfAttention/Decoder-2-MultiHeadSelfAttention_bo", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadSelfAttention-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Decoder-2-MultiHeadSelfAttention-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-FeedForward/Decoder-3-FeedForward_W1", "shape": [32, 128], "dtype": "float32"}, {"name": "Decoder-3-FeedForward/Decoder-3-FeedForward_b1", "shape": [128], "dtype": "float32"}, {"name": "Decoder-3-FeedForward/Decoder-3-FeedForward_W2", "shape": [128, 32], "dtype": "float32"}, {"name": "Decoder-3-FeedForward/Decoder-3-FeedForward_b2", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-FeedForward-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-FeedForward-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadQueryAttention/Decoder-3-MultiHeadQueryAttention_Wq", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadQueryAttention/Decoder-3-MultiHeadQueryAttention_bq", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadQueryAttention/Decoder-3-MultiHeadQueryAttention_Wk", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadQueryAttention/Decoder-3-MultiHeadQueryAttention_bk", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadQueryAttention/Decoder-3-MultiHeadQueryAttention_Wv", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadQueryAttention/Decoder-3-MultiHeadQueryAttention_bv", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadQueryAttention/Decoder-3-MultiHeadQueryAttention_Wo", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadQueryAttention/Decoder-3-MultiHeadQueryAttention_bo", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadQueryAttention-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadQueryAttention-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadSelfAttention/Decoder-3-MultiHeadSelfAttention_Wq", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadSelfAttention/Decoder-3-MultiHeadSelfAttention_bq", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadSelfAttention/Decoder-3-MultiHeadSelfAttention_Wk", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadSelfAttention/Decoder-3-MultiHeadSelfAttention_bk", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadSelfAttention/Decoder-3-MultiHeadSelfAttention_Wv", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadSelfAttention/Decoder-3-MultiHeadSelfAttention_bv", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadSelfAttention/Decoder-3-MultiHeadSelfAttention_Wo", "shape": [32, 32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadSelfAttention/Decoder-3-MultiHeadSelfAttention_bo", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadSelfAttention-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Decoder-3-MultiHeadSelfAttention-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Decoder-Output/bias", "shape": [3812], "dtype": "float32"}, {"name": "Decoder-Token-Embedding/embeddings", "shape": [3812, 32], "dtype": "float32"}, {"name": "Encoder-1-FeedForward/Encoder-1-FeedForward_W1", "shape": [32, 128], "dtype": "float32"}, {"name": "Encoder-1-FeedForward/Encoder-1-FeedForward_b1", "shape": [128], "dtype": "float32"}, {"name": "Encoder-1-FeedForward/Encoder-1-FeedForward_W2", "shape": [128, 32], "dtype": "float32"}, {"name": "Encoder-1-FeedForward/Encoder-1-FeedForward_b2", "shape": [32], "dtype": "float32"}, {"name": "Encoder-1-FeedForward-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Encoder-1-FeedForward-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Encoder-1-MultiHeadSelfAttention/Encoder-1-MultiHeadSelfAttention_Wq", "shape": [32, 32], "dtype": "float32"}, {"name": "Encoder-1-MultiHeadSelfAttention/Encoder-1-MultiHeadSelfAttention_bq", "shape": [32], "dtype": "float32"}, {"name": "Encoder-1-MultiHeadSelfAttention/Encoder-1-MultiHeadSelfAttention_Wk", "shape": [32, 32], "dtype": "float32"}, {"name": "Encoder-1-MultiHeadSelfAttention/Encoder-1-MultiHeadSelfAttention_bk", "shape": [32], "dtype": "float32"}, {"name": "Encoder-1-MultiHeadSelfAttention/Encoder-1-MultiHeadSelfAttention_Wv", "shape": [32, 32], "dtype": "float32"}, {"name": "Encoder-1-MultiHeadSelfAttention/Encoder-1-MultiHeadSelfAttention_bv", "shape": [32], "dtype": "float32"}, {"name": "Encoder-1-MultiHeadSelfAttention/Encoder-1-MultiHeadSelfAttention_Wo", "shape": [32, 32], "dtype": "float32"}, {"name": "Encoder-1-MultiHeadSelfAttention/Encoder-1-MultiHeadSelfAttention_bo", "shape": [32], "dtype": "float32"}, {"name": "Encoder-1-MultiHeadSelfAttention-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Encoder-1-MultiHeadSelfAttention-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Encoder-2-FeedForward/Encoder-2-FeedForward_W1", "shape": [32, 128], "dtype": "float32"}, {"name": "Encoder-2-FeedForward/Encoder-2-FeedForward_b1", "shape": [128], "dtype": "float32"}, {"name": "Encoder-2-FeedForward/Encoder-2-FeedForward_W2", "shape": [128, 32], "dtype": "float32"}, {"name": "Encoder-2-FeedForward/Encoder-2-FeedForward_b2", "shape": [32], "dtype": "float32"}, {"name": "Encoder-2-FeedForward-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Encoder-2-FeedForward-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Encoder-2-MultiHeadSelfAttention/Encoder-2-MultiHeadSelfAttention_Wq", "shape": [32, 32], "dtype": "float32"}, {"name": "Encoder-2-MultiHeadSelfAttention/Encoder-2-MultiHeadSelfAttention_bq", "shape": [32], "dtype": "float32"}, {"name": "Encoder-2-MultiHeadSelfAttention/Encoder-2-MultiHeadSelfAttention_Wk", "shape": [32, 32], "dtype": "float32"}, {"name": "Encoder-2-MultiHeadSelfAttention/Encoder-2-MultiHeadSelfAttention_bk", "shape": [32], "dtype": "float32"}, {"name": "Encoder-2-MultiHeadSelfAttention/Encoder-2-MultiHeadSelfAttention_Wv", "shape": [32, 32], "dtype": "float32"}, {"name": "Encoder-2-MultiHeadSelfAttention/Encoder-2-MultiHeadSelfAttention_bv", "shape": [32], "dtype": "float32"}, {"name": "Encoder-2-MultiHeadSelfAttention/Encoder-2-MultiHeadSelfAttention_Wo", "shape": [32, 32], "dtype": "float32"}, {"name": "Encoder-2-MultiHeadSelfAttention/Encoder-2-MultiHeadSelfAttention_bo", "shape": [32], "dtype": "float32"}, {"name": "Encoder-2-MultiHeadSelfAttention-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Encoder-2-MultiHeadSelfAttention-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Encoder-3-FeedForward/Encoder-3-FeedForward_W1", "shape": [32, 128], "dtype": "float32"}, {"name": "Encoder-3-FeedForward/Encoder-3-FeedForward_b1", "shape": [128], "dtype": "float32"}, {"name": "Encoder-3-FeedForward/Encoder-3-FeedForward_W2", "shape": [128, 32], "dtype": "float32"}, {"name": "Encoder-3-FeedForward/Encoder-3-FeedForward_b2", "shape": [32], "dtype": "float32"}, {"name": "Encoder-3-FeedForward-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Encoder-3-FeedForward-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Encoder-3-MultiHeadSelfAttention/Encoder-3-MultiHeadSelfAttention_Wq", "shape": [32, 32], "dtype": "float32"}, {"name": "Encoder-3-MultiHeadSelfAttention/Encoder-3-MultiHeadSelfAttention_bq", "shape": [32], "dtype": "float32"}, {"name": "Encoder-3-MultiHeadSelfAttention/Encoder-3-MultiHeadSelfAttention_Wk", "shape": [32, 32], "dtype": "float32"}, {"name": "Encoder-3-MultiHeadSelfAttention/Encoder-3-MultiHeadSelfAttention_bk", "shape": [32], "dtype": "float32"}, {"name": "Encoder-3-MultiHeadSelfAttention/Encoder-3-MultiHeadSelfAttention_Wv", "shape": [32, 32], "dtype": "float32"}, {"name": "Encoder-3-MultiHeadSelfAttention/Encoder-3-MultiHeadSelfAttention_bv", "shape": [32], "dtype": "float32"}, {"name": "Encoder-3-MultiHeadSelfAttention/Encoder-3-MultiHeadSelfAttention_Wo", "shape": [32, 32], "dtype": "float32"}, {"name": "Encoder-3-MultiHeadSelfAttention/Encoder-3-MultiHeadSelfAttention_bo", "shape": [32], "dtype": "float32"}, {"name": "Encoder-3-MultiHeadSelfAttention-Norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "Encoder-3-MultiHeadSelfAttention-Norm/beta", "shape": [32], "dtype": "float32"}, {"name": "Encoder-Token-Embedding/embeddings", "shape": [3812, 32], "dtype": "float32"}]}]}